Zaimit/models/User.php

SELECT * FROM `tblWorker` WHERE `id_worker`=2
---
    public function getWorker(){
        return TblWorker::findOne($this->id_worker);

SELECT * FROM `tblWorker` WHERE `id_worker`=2
---
    public function isAdmin(){

	return TblWorker::findOne($this->id_worker)->is_admin == 1 ? TRUE : FALSE;