Zaimit/controllers/SiteController.php

SELECT * FROM `tblClient` WHERE `id_client`='1'
---
    public function actionView($id)
    {
        $client = Clients::findOne($id);
        $pagination = new Pagination(['defaultPageSize'=>10]);
        $dataProvider = new ActiveDataProvider(['query' => TblLoan::find()->where(['id_client'=>$id]), 'pagination' => $pagination]);

SELECT * FROM `tblLoan` WHERE `id_loan`='1'
---
    public function actionAdd_pay($id)
    {
        $loan = TblLoan::find()->where(['id_loan'=>$id])->one();

SELECT * FROM `tblLoan` WHERE `id_loan`='1'
---
    public function actionCheck_pays($id)
    {
        $loan = TblLoan::findOne($id);
        $pagination = new Pagination(['defaultPageSize'=>10]);
        $dataProvider = new ActiveDataProvider(['query' => TblPay::find()->where(['id_loan'=>$id]), 'pagination' => $pagination]);